In [95]:
import numpy as np
import pandas as pd

In [96]:
titanic = pd.read_csv('titanic/train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [97]:
titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [98]:
title = []
for i in range(len(titanic.Name)) :
    title.append(titanic.Name.str.split(', ')[i][1].split('.')[0])
titanic['title'] = title

In [99]:
title_list = list(set(title))
title_list

['Miss',
 'Sir',
 'Capt',
 'Ms',
 'Major',
 'Lady',
 'the Countess',
 'Master',
 'Don',
 'Mme',
 'Mrs',
 'Rev',
 'Col',
 'Dr',
 'Jonkheer',
 'Mlle',
 'Mr']

In [100]:
for i in title_list :
    titanic[f'{i}'] = titanic[titanic.title == f'{i}'].Age.fillna(round(titanic[titanic.title == f'{i}'].Age.mean()))
titanic['Age'] = titanic[title_list].sum(axis = 1)
titanic = titanic.drop(columns = title_list, axis = 1)
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Rev
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Miss
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,22.0,1,2,W./C. 6607,23.4500,NaN,S,Miss
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Mr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Mr

In [101]:
titanic = titanic.dropna(subset = ['Embarked'], how = 'any', axis=0).reset_index()
titanic.isna().any()

index          False
PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked       False
title          False
dtype: bool

In [102]:
ct = []
cn = []
for i in titanic.Cabin :
    try :
        ct.append(list(i)[0])
        cn.append(''.join(list(i)[1:]).split(' ')[0])
    except :
        ct.append('')
        cn.append('')
        continue

titanic['ct'] = ct
titanic['cn'] = cn
titanic

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title,ct,cn
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,,
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,C,85
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,,
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,C,123
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Rev,,
885,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Miss,B,42
886,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,22.0,1,2,W./C. 6607,23.4500,NaN,S,Miss,,
887,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Mr,C,148
888,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Mr,,

In [103]:
titanic1 = titanic
titanic1

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,title,ct,cn
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,,
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,C,85
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,,
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,C,123
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Rev,,
885,887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Miss,B,42
886,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,22.0,1,2,W./C. 6607,23.4500,NaN,S,Miss,,
887,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Mr,C,148
888,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Mr,,

In [104]:
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import MinMaxScaler

In [105]:
sex = LabelEncoder().fit_transform(titanic.Sex)
sex_oh = OneHotEncoder().fit_transform(sex.reshape(-1,1)).toarray()
titanic1['Sex'] = sex_oh

In [106]:
embarked = LabelEncoder().fit_transform(titanic.Embarked)
embarked_oh = OneHotEncoder().fit_transform(embarked.reshape(-1,1)).toarray()
titanic1['Embarked'] = embarked_oh

In [107]:
title = LabelEncoder().fit_transform(titanic.title)
title_oh = OneHotEncoder().fit_transform(title.reshape(-1,1)).toarray()
titanic1['Name'] = title_oh

In [108]:
ct = LabelEncoder().fit_transform(titanic.ct)
ct_oh = OneHotEncoder().fit_transform(ct.reshape(-1,1)).toarray()
titanic1['Cabin'] = ct_oh

In [109]:
a = titanic.Age.values
age = MinMaxScaler().fit_transform(a.reshape(-1, 1))
titanic1['Age'] = age

In [110]:
f = titanic.Fare.values
fare = MinMaxScaler().fit_transform(f.reshape(-1, 1))
titanic1['Fare'] = fare

In [111]:
s = titanic.Fare.values
sibsp = MinMaxScaler().fit_transform(s.reshape(-1, 1))
titanic1['SibSp'] = sibsp

In [112]:
p = titanic.Fare.values
parch = MinMaxScaler().fit_transform(p.reshape(-1, 1))
titanic1['Parch'] = parch

In [126]:
titanic1.iloc[:, [3, 4, 5, 6, 7, 8, 10, 11, 12]]

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,3,0.0,0.0,0.271174,0.014151,0.014151,0.014151,1.0,0.0
1,1,0.0,1.0,0.472229,0.139136,0.139136,0.139136,0.0,1.0
2,3,0.0,1.0,0.321438,0.015469,0.015469,0.015469,1.0,0.0
3,1,0.0,1.0,0.434531,0.103644,0.103644,0.103644,0.0,0.0
4,3,0.0,0.0,0.434531,0.015713,0.015713,0.015713,1.0,0.0
...,...,...,...,...,...,...,...,...,...
884,2,0.0,0.0,0.334004,0.025374,0.025374,0.025374,1.0,0.0
885,1,0.0,1.0,0.233476,0.058556,0.058556,0.058556,0.0,0.0
886,3,0.0,1.0,0.271174,0.045771,0.045771,0.045771,1.0,0.0
887,1,0.0,0.0,0.321438,0.058556,0.058556,0.058556,0.0,1.0
888,3,0.0,0.0,0.396833,0.015127,0.015127,0.015127,1.0,0.0

In [127]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(
    titanic1.iloc[:, [3, 4, 5, 6, 7, 8, 10, 11, 12]], titanic1.Survived, stratify = titanic1.Survived, test_size = 0.2, random_state = 2021
)
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((711, 9), (178, 9), (711,), (178,))

In [128]:
pd.Series(y_test).value_counts()

0    110
1     68
Name: Survived, dtype: int64

In [129]:
from sklearn.metrics import accuracy_score
pred = DecisionTreeClassifier(random_state = 2021).fit(X_train, y_train).predict(X_test)
accuracy_score(y_test, pred)

0.7471910112359551

In [152]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import GridSearchCV
param = {
    'max_depth' : [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
    'min_samples_split' : [2, 3, 4, 5, 6, 7, 8, 9, 10]
}

In [153]:
grid = GridSearchCV(DecisionTreeClassifier(), param_grid = param, cv = 5, scoring = 'accuracy')
grid.fit(X_train, y_train)

GridSearchCV(cv=5, estimator=DecisionTreeClassifier(),
             param_grid={'max_depth': [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
                         'min_samples_split': [2, 3, 4, 5, 6, 7, 8, 9, 10]},
             scoring='accuracy')

In [154]:
grid.best_score_, grid.best_params_

(0.8326504481434058, {'max_depth': 10, 'min_samples_split': 3})

In [155]:
pred_grid = grid.best_estimator_.predict(X_test)
accuracy_score(y_test, pred_grid)

0.7752808988764045

In [170]:
test = pd.read_csv('titanic/test.csv')
sur = pd.read_csv('titanic/gender_submission.csv')
sample = pd.merge(test, sur)
sample = sample[['Survived','PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked']]
sample

,Survived,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,0,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,0,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,1,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,0,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,0,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,0,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,0,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [177]:
test.iloc[0, 1:]

Pclass                     3
Name        Kelly, Mr. James
Sex                     male
Age                     34.5
SibSp                      0
Parch                      0
Ticket                330911
Fare                  7.8292
Cabin                    NaN
Embarked                   Q
Name: 0, dtype: object

In [180]:
predict = DecisionTreeClassifier().predict(np.array(test.iloc[0, 1:]).reshape(0, 10))
predict

ValueError: cannot reshape array of size 10 into shape (0,10)